function [ ] = drawtTemperatureRrend(handle,TG ,opt )
%   绘制沿高度方向的温度趋势图
%   handle:绘制图形的句柄
%   TG:沿高度方向的温度梯度数据
%   opt:绘图可选参数，比如plot中的'r*',为字符串
%   可以根据需要添加输入，输出参数，接口中是否需要参数isHoldOn?
%   柱状图的颜色是否需要参数？

disp('沿高度方向的温度趋势图')

%% 需要重新设计画图逻辑 
% %% 测试数据
clear
close all
clc
% hight = 3;
% opt = 'r.-';
TG(1,:) = [2017, 2, 02, 07, 02, 0, 1600,1500,1400,1300,1200,1100,1000,900, 800,00, 60, 50, 40, 30, 20, 10] ;% 12位置的信息
TG(end+1,:) = [2017, 2, 02, 07, 04, 0, 1600,1500,1400,1300,1200,1100,1000,900, 800,700, 600, 500, 400, 300, 200, 100] ;% 12位置的信息
TG(end+1,:) = [2017, 2, 02, 07, 06, 0,1600,1500,1400,1300, 1200,1100,1000,900, 800,700, 600, 500, 400, 300, 200, 100] ;% 12位置的信息
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

BarData = TG(:,7:end);

Hour = TG(:,4); 
Minute = TG(:,5);  
interval = datenum(0,0,0,Hour,Minute,0);
% bar(interval,TG(:,7:end));
bar(BarData,'stacked')
map = [255 248 220;
255 228 225;
238 130 238;
255 0 255;
255 0 0;
255 140 0;
255 165 0;
255 255 0;
192 255 62;
127 255 0;
0 255 0;
0 255 127;
0 255 255;
135 206 250;
0 0 255;
205 201 201]./255;
map2 = map(end,:);
for index = size(map,1)-1:(-1):1
    map2(end+1,:) = map(index,:);
end

% colormap(parula)

colormap(map2)
colorbar

h = colorbar;
set(h ,'YTick',[0 100 1600]);
t = get(h,'YTickLabel');
% t = get(h,'YTickLabel')
t{16,1} = '>=1500°C';
t{15,1} = '1400~1499°C ';
t{14,1} = '1300~1399°C ';
t{13,1} = '1200~1299°C ';
t{12,1} = '1100~1199°C ';
t{11,1} = '1000~1099°C ';
t{10,1} = '900~999°C ';
t{9,1} = '800~899°C ';
t{8,1} = '700~799°C ';
t{7,1} = '600~699°C ';
t{6,1} = '500~599°C ';
t{5,1} = '400~499°C ';
t{4,1} = '300~399°C ';
t{3,1} = '200~299°C ';
t{2,1} = '100~199°C ';
t{1,1} = '<=99°C ';
% set(h,'YTickLabel',t);

% myC= [0 0 1
%   1 0 0
%   1 0.4 0
%   0 0.8 1
%   0.6 0 1
%   0 1 0 ];
% data2D = rand(10,6);
% H=bar(data2D, 'stack');
% for k=1:6
%   set(H(k),'facecolor',myC(k,:))
% end
% t2={'>=1500°C';'1400~1499°C '; '1300~1399°C '; '1200~1299°C '; '1100~1199°C '; '1000~1099°C '; '900~999°C '; '800~899°C '; '700~799°C '; '600~699°C '; '500~599°C '; '400~499°C '; '300~399°C '; '200~299°C '; '100~199°C '; '<=99°C '}
% 数据反了，需要处理下
t2 ={'>=1500°C','1400~1499°C ', '1300~1399°C ', '1200~1299°C ', '1100~1199°C ', '1000~1099°C ', '900~999°C ', '800~899°C ', '700~799°C ', '600~699°C ', '500~599°C ', '400~499°C ', '300~399°C ', '200~299°C ', '100~199°C ', '<=99°C '};
t2 = t';
% AX=legend(h,t2, 'Location','Best','FontSize',8);
AX=legend( t2);
return
% x = interval;   
datetick('x','HH:MM'); %需用x作为数组变量
xlabel('时间'); ylabel('温度 (kpa)');
set(gca,'ylim',[0 1500],'ytick',0:100:1500);
title('不同高度位置在烧结过程中的温度变化趋势')


end